bitbane/CANT/reCANT_SW/board/pin_mux.h
/***********************************************************************************************************************
 * This file was generated by the MCUXpresso Config Tools. Any manual edits made to this file
 * will be overwritten if the respective MCUXpresso Config Tools is used to update this file.
 **********************************************************************************************************************/

#ifndef _PIN_MUX_H_
#define _PIN_MUX_H_

/***********************************************************************************************************************
 * Definitions
 **********************************************************************************************************************/

/*! @brief Direction type  */
typedef enum _pin_mux_direction
{
  kPIN_MUX_DirectionInput = 0U,         /* Input direction */
  kPIN_MUX_DirectionOutput = 1U,        /* Output direction */
  kPIN_MUX_DirectionInputOrOutput = 2U  /* Input or output direction */
} pin_mux_direction_t;

/*!
 * @addtogroup pin_mux
 * @{
 */

/***********************************************************************************************************************
 * API
 **********************************************************************************************************************/

#if defined(__cplusplus)
extern "C" {
#endif

/*!
 * @brief Calls initialization functions.
 *
 */
void BOARD_InitBootPins(void);

#define BOARD_INITPINS_IOMUXC_GPR_GPR26_GPIO_MUX1_GPIO_SEL_MASK 0x0C000000U /*!< GPIO1 and GPIO6 share same IO MUX function, GPIO_MUX1 selects one GPIO function: affected bits mask */
#define BOARD_INITPINS_IOMUXC_GPR_GPR27_GPIO_MUX2_GPIO_SEL_MASK 0xC0031C0DU /*!< GPIO2 and GPIO7 share same IO MUX function, GPIO_MUX2 selects one GPIO function: affected bits mask */
#define BOARD_INITPINS_IOMUXC_GPR_GPR29_GPIO_MUX4_GPIO_SEL_MASK 0x0170U /*!< GPIO4 and GPIO9 share same IO MUX function, GPIO_MUX4 selects one GPIO function: affected bits mask */

/* GPIO_EMC_04 (coord F2), CAN2_SW */
/* Routed pin properties */
#define BOARD_INITPINS_CAN2_SW_PERIPHERAL                                  GPIO4   /*!< Peripheral name */
#define BOARD_INITPINS_CAN2_SW_SIGNAL                                    gpio_io   /*!< Signal name */
#define BOARD_INITPINS_CAN2_SW_CHANNEL                                        4U   /*!< Signal channel */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_CAN2_SW_GPIO                                        GPIO4   /*!< GPIO peripheral base pointer */
#define BOARD_INITPINS_CAN2_SW_GPIO_PIN                                       4U   /*!< GPIO pin number */
#define BOARD_INITPINS_CAN2_SW_GPIO_PIN_MASK                          (1U << 4U)   /*!< GPIO pin mask */
#define BOARD_INITPINS_CAN2_SW_PORT                                        GPIO4   /*!< PORT peripheral base pointer */
#define BOARD_INITPINS_CAN2_SW_PIN                                            4U   /*!< PORT pin number */
#define BOARD_INITPINS_CAN2_SW_PIN_MASK                               (1U << 4U)   /*!< PORT pin mask */

/* GPIO_EMC_05 (coord G5), CAN2_LED */
/* Routed pin properties */
#define BOARD_INITPINS_CAN2_LED_PERIPHERAL                                 GPIO4   /*!< Peripheral name */
#define BOARD_INITPINS_CAN2_LED_SIGNAL                                   gpio_io   /*!< Signal name */
#define BOARD_INITPINS_CAN2_LED_CHANNEL                                       5U   /*!< Signal channel */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_CAN2_LED_GPIO                                       GPIO4   /*!< GPIO peripheral base pointer */
#define BOARD_INITPINS_CAN2_LED_GPIO_PIN                                      5U   /*!< GPIO pin number */
#define BOARD_INITPINS_CAN2_LED_GPIO_PIN_MASK                         (1U << 5U)   /*!< GPIO pin mask */
#define BOARD_INITPINS_CAN2_LED_PORT                                       GPIO4   /*!< PORT peripheral base pointer */
#define BOARD_INITPINS_CAN2_LED_PIN                                           5U   /*!< PORT pin number */
#define BOARD_INITPINS_CAN2_LED_PIN_MASK                              (1U << 5U)   /*!< PORT pin mask */

/* GPIO_EMC_06 (coord H5), RUN_CANCAT */
/* Routed pin properties */
#define BOARD_INITPINS_RUN_CANCAT_PERIPHERAL                               GPIO4   /*!< Peripheral name */
#define BOARD_INITPINS_RUN_CANCAT_SIGNAL                                 gpio_io   /*!< Signal name */
#define BOARD_INITPINS_RUN_CANCAT_CHANNEL                                     6U   /*!< Signal channel */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_RUN_CANCAT_GPIO                                     GPIO4   /*!< GPIO peripheral base pointer */
#define BOARD_INITPINS_RUN_CANCAT_GPIO_PIN                                    6U   /*!< GPIO pin number */
#define BOARD_INITPINS_RUN_CANCAT_GPIO_PIN_MASK                       (1U << 6U)   /*!< GPIO pin mask */
#define BOARD_INITPINS_RUN_CANCAT_PORT                                     GPIO4   /*!< PORT peripheral base pointer */
#define BOARD_INITPINS_RUN_CANCAT_PIN                                         6U   /*!< PORT pin number */
#define BOARD_INITPINS_RUN_CANCAT_PIN_MASK                            (1U << 6U)   /*!< PORT pin mask */

/* GPIO_EMC_08 (coord H3), RUN_CANT */
/* Routed pin properties */
#define BOARD_INITPINS_RUN_CANT_PERIPHERAL                                 GPIO4   /*!< Peripheral name */
#define BOARD_INITPINS_RUN_CANT_SIGNAL                                   gpio_io   /*!< Signal name */
#define BOARD_INITPINS_RUN_CANT_CHANNEL                                       8U   /*!< Signal channel */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_RUN_CANT_GPIO                                       GPIO4   /*!< GPIO peripheral base pointer */
#define BOARD_INITPINS_RUN_CANT_GPIO_PIN                                      8U   /*!< GPIO pin number */
#define BOARD_INITPINS_RUN_CANT_GPIO_PIN_MASK                         (1U << 8U)   /*!< GPIO pin mask */
#define BOARD_INITPINS_RUN_CANT_PORT                                       GPIO4   /*!< PORT peripheral base pointer */
#define BOARD_INITPINS_RUN_CANT_PIN                                           8U   /*!< PORT pin number */
#define BOARD_INITPINS_RUN_CANT_PIN_MASK                              (1U << 8U)   /*!< PORT pin mask */

/* GPIO_B0_10 (coord D9), RUN_SOCKETCAN */
/* Routed pin properties */
#define BOARD_INITPINS_RUN_SOCKETCAN_PERIPHERAL                            GPIO2   /*!< Peripheral name */
#define BOARD_INITPINS_RUN_SOCKETCAN_SIGNAL                              gpio_io   /*!< Signal name */
#define BOARD_INITPINS_RUN_SOCKETCAN_CHANNEL                                 10U   /*!< Signal channel */

