bitbane/CANT/reCANT_SW/board/pin_mux.h
/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_RUN_SOCKETCAN_GPIO                                  GPIO2   /*!< GPIO peripheral base pointer */
#define BOARD_INITPINS_RUN_SOCKETCAN_GPIO_PIN                                10U   /*!< GPIO pin number */
#define BOARD_INITPINS_RUN_SOCKETCAN_GPIO_PIN_MASK                   (1U << 10U)   /*!< GPIO pin mask */
#define BOARD_INITPINS_RUN_SOCKETCAN_PORT                                  GPIO2   /*!< PORT peripheral base pointer */
#define BOARD_INITPINS_RUN_SOCKETCAN_PIN                                     10U   /*!< PORT pin number */
#define BOARD_INITPINS_RUN_SOCKETCAN_PIN_MASK                        (1U << 10U)   /*!< PORT pin mask */

/* GPIO_B1_01 (coord B11), RUN_TRUCKDEVIL */
/* Routed pin properties */
#define BOARD_INITPINS_RUN_TRUCKDEVIL_PERIPHERAL                           GPIO2   /*!< Peripheral name */
#define BOARD_INITPINS_RUN_TRUCKDEVIL_SIGNAL                             gpio_io   /*!< Signal name */
#define BOARD_INITPINS_RUN_TRUCKDEVIL_CHANNEL                                17U   /*!< Signal channel */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_RUN_TRUCKDEVIL_GPIO                                 GPIO2   /*!< GPIO peripheral base pointer */
#define BOARD_INITPINS_RUN_TRUCKDEVIL_GPIO_PIN                               17U   /*!< GPIO pin number */
#define BOARD_INITPINS_RUN_TRUCKDEVIL_GPIO_PIN_MASK                  (1U << 17U)   /*!< GPIO pin mask */
#define BOARD_INITPINS_RUN_TRUCKDEVIL_PORT                                 GPIO2   /*!< PORT peripheral base pointer */
#define BOARD_INITPINS_RUN_TRUCKDEVIL_PIN                                    17U   /*!< PORT pin number */
#define BOARD_INITPINS_RUN_TRUCKDEVIL_PIN_MASK                       (1U << 17U)   /*!< PORT pin mask */

/* GPIO_B1_00 (coord A11), RUN_SW5 */
/* Routed pin properties */
#define BOARD_INITPINS_RUN_SW5_PERIPHERAL                                  GPIO2   /*!< Peripheral name */
#define BOARD_INITPINS_RUN_SW5_SIGNAL                                    gpio_io   /*!< Signal name */
#define BOARD_INITPINS_RUN_SW5_CHANNEL                                       16U   /*!< Signal channel */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_RUN_SW5_GPIO                                        GPIO2   /*!< GPIO peripheral base pointer */
#define BOARD_INITPINS_RUN_SW5_GPIO_PIN                                      16U   /*!< GPIO pin number */
#define BOARD_INITPINS_RUN_SW5_GPIO_PIN_MASK                         (1U << 16U)   /*!< GPIO pin mask */
#define BOARD_INITPINS_RUN_SW5_PORT                                        GPIO2   /*!< PORT peripheral base pointer */
#define BOARD_INITPINS_RUN_SW5_PIN                                           16U   /*!< PORT pin number */
#define BOARD_INITPINS_RUN_SW5_PIN_MASK                              (1U << 16U)   /*!< PORT pin mask */

/* GPIO_B0_11 (coord A10), RUN_SW6 */
/* Routed pin properties */
#define BOARD_INITPINS_RUN_SW6_PERIPHERAL                                  GPIO2   /*!< Peripheral name */
#define BOARD_INITPINS_RUN_SW6_SIGNAL                                    gpio_io   /*!< Signal name */
#define BOARD_INITPINS_RUN_SW6_CHANNEL                                       11U   /*!< Signal channel */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_RUN_SW6_GPIO                                        GPIO2   /*!< GPIO peripheral base pointer */
#define BOARD_INITPINS_RUN_SW6_GPIO_PIN                                      11U   /*!< GPIO pin number */
#define BOARD_INITPINS_RUN_SW6_GPIO_PIN_MASK                         (1U << 11U)   /*!< GPIO pin mask */
#define BOARD_INITPINS_RUN_SW6_PORT                                        GPIO2   /*!< PORT peripheral base pointer */
#define BOARD_INITPINS_RUN_SW6_PIN                                           11U   /*!< PORT pin number */
#define BOARD_INITPINS_RUN_SW6_PIN_MASK                              (1U << 11U)   /*!< PORT pin mask */

/* GPIO_B0_00 (coord D7), RUN_SW7 */
/* Routed pin properties */
#define BOARD_INITPINS_RUN_SW7_PERIPHERAL                                  GPIO2   /*!< Peripheral name */
#define BOARD_INITPINS_RUN_SW7_SIGNAL                                    gpio_io   /*!< Signal name */
#define BOARD_INITPINS_RUN_SW7_CHANNEL                                        0U   /*!< Signal channel */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_RUN_SW7_GPIO                                        GPIO2   /*!< GPIO peripheral base pointer */
#define BOARD_INITPINS_RUN_SW7_GPIO_PIN                                       0U   /*!< GPIO pin number */
#define BOARD_INITPINS_RUN_SW7_GPIO_PIN_MASK                          (1U << 0U)   /*!< GPIO pin mask */
#define BOARD_INITPINS_RUN_SW7_PORT                                        GPIO2   /*!< PORT peripheral base pointer */
#define BOARD_INITPINS_RUN_SW7_PIN                                            0U   /*!< PORT pin number */
#define BOARD_INITPINS_RUN_SW7_PIN_MASK                               (1U << 0U)   /*!< PORT pin mask */

/* GPIO_B0_02 (coord E8), RUN_SW8 */
/* Routed pin properties */
#define BOARD_INITPINS_RUN_SW8_PERIPHERAL                                  GPIO2   /*!< Peripheral name */
#define BOARD_INITPINS_RUN_SW8_SIGNAL                                    gpio_io   /*!< Signal name */
#define BOARD_INITPINS_RUN_SW8_CHANNEL                                        2U   /*!< Signal channel */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_RUN_SW8_GPIO                                        GPIO2   /*!< GPIO peripheral base pointer */
#define BOARD_INITPINS_RUN_SW8_GPIO_PIN                                       2U   /*!< GPIO pin number */
#define BOARD_INITPINS_RUN_SW8_GPIO_PIN_MASK                          (1U << 2U)   /*!< GPIO pin mask */
#define BOARD_INITPINS_RUN_SW8_PORT                                        GPIO2   /*!< PORT peripheral base pointer */
#define BOARD_INITPINS_RUN_SW8_PIN                                            2U   /*!< PORT pin number */
#define BOARD_INITPINS_RUN_SW8_PIN_MASK                               (1U << 2U)   /*!< PORT pin mask */

/* GPIO_B1_14 (coord C14), PWR_LED */
/* Routed pin properties */
#define BOARD_INITPINS_PWR_LED_PERIPHERAL                                  GPIO2   /*!< Peripheral name */
#define BOARD_INITPINS_PWR_LED_SIGNAL                                    gpio_io   /*!< Signal name */
#define BOARD_INITPINS_PWR_LED_CHANNEL                                       30U   /*!< Signal channel */

