bitbane/CANT/reCANT_SW/board/pin_mux.h
/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_PWR_LED_GPIO                                        GPIO2   /*!< GPIO peripheral base pointer */
#define BOARD_INITPINS_PWR_LED_GPIO_PIN                                      30U   /*!< GPIO pin number */
#define BOARD_INITPINS_PWR_LED_GPIO_PIN_MASK                         (1U << 30U)   /*!< GPIO pin mask */
#define BOARD_INITPINS_PWR_LED_PORT                                        GPIO2   /*!< PORT peripheral base pointer */
#define BOARD_INITPINS_PWR_LED_PIN                                           30U   /*!< PORT pin number */
#define BOARD_INITPINS_PWR_LED_PIN_MASK                              (1U << 30U)   /*!< PORT pin mask */

/* GPIO_B1_15 (coord B14), CAN3_LED */
/* Routed pin properties */
#define BOARD_INITPINS_CAN3_LED_PERIPHERAL                                 GPIO2   /*!< Peripheral name */
#define BOARD_INITPINS_CAN3_LED_SIGNAL                                   gpio_io   /*!< Signal name */
#define BOARD_INITPINS_CAN3_LED_CHANNEL                                      31U   /*!< Signal channel */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_CAN3_LED_GPIO                                       GPIO2   /*!< GPIO peripheral base pointer */
#define BOARD_INITPINS_CAN3_LED_GPIO_PIN                                     31U   /*!< GPIO pin number */
#define BOARD_INITPINS_CAN3_LED_GPIO_PIN_MASK                        (1U << 31U)   /*!< GPIO pin mask */
#define BOARD_INITPINS_CAN3_LED_PORT                                       GPIO2   /*!< PORT peripheral base pointer */
#define BOARD_INITPINS_CAN3_LED_PIN                                          31U   /*!< PORT pin number */
#define BOARD_INITPINS_CAN3_LED_PIN_MASK                             (1U << 31U)   /*!< PORT pin mask */

/* GPIO_B0_12 (coord C10), CAN3_SW */
/* Routed pin properties */
#define BOARD_INITPINS_CAN3_SW_PERIPHERAL                                  GPIO2   /*!< Peripheral name */
#define BOARD_INITPINS_CAN3_SW_SIGNAL                                    gpio_io   /*!< Signal name */
#define BOARD_INITPINS_CAN3_SW_CHANNEL                                       12U   /*!< Signal channel */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_CAN3_SW_GPIO                                        GPIO2   /*!< GPIO peripheral base pointer */
#define BOARD_INITPINS_CAN3_SW_GPIO_PIN                                      12U   /*!< GPIO pin number */
#define BOARD_INITPINS_CAN3_SW_GPIO_PIN_MASK                         (1U << 12U)   /*!< GPIO pin mask */
#define BOARD_INITPINS_CAN3_SW_PORT                                        GPIO2   /*!< PORT peripheral base pointer */
#define BOARD_INITPINS_CAN3_SW_PIN                                           12U   /*!< PORT pin number */
#define BOARD_INITPINS_CAN3_SW_PIN_MASK                              (1U << 12U)   /*!< PORT pin mask */

/* GPIO_AD_B1_11 (coord J13), CAN1_SW */
/* Routed pin properties */
#define BOARD_INITPINS_CAN1_SW_PERIPHERAL                                  GPIO1   /*!< Peripheral name */
#define BOARD_INITPINS_CAN1_SW_SIGNAL                                    gpio_io   /*!< Signal name */
#define BOARD_INITPINS_CAN1_SW_CHANNEL                                       27U   /*!< Signal channel */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_CAN1_SW_GPIO                                        GPIO1   /*!< GPIO peripheral base pointer */
#define BOARD_INITPINS_CAN1_SW_GPIO_PIN                                      27U   /*!< GPIO pin number */
#define BOARD_INITPINS_CAN1_SW_GPIO_PIN_MASK                         (1U << 27U)   /*!< GPIO pin mask */
#define BOARD_INITPINS_CAN1_SW_PORT                                        GPIO1   /*!< PORT peripheral base pointer */
#define BOARD_INITPINS_CAN1_SW_PIN                                           27U   /*!< PORT pin number */
#define BOARD_INITPINS_CAN1_SW_PIN_MASK                              (1U << 27U)   /*!< PORT pin mask */

/* GPIO_AD_B1_10 (coord L13), CAN1_LED */
/* Routed pin properties */
#define BOARD_INITPINS_CAN1_LED_PERIPHERAL                                 GPIO1   /*!< Peripheral name */
#define BOARD_INITPINS_CAN1_LED_SIGNAL                                   gpio_io   /*!< Signal name */
#define BOARD_INITPINS_CAN1_LED_CHANNEL                                      26U   /*!< Signal channel */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_CAN1_LED_GPIO                                       GPIO1   /*!< GPIO peripheral base pointer */
#define BOARD_INITPINS_CAN1_LED_GPIO_PIN                                     26U   /*!< GPIO pin number */
#define BOARD_INITPINS_CAN1_LED_GPIO_PIN_MASK                        (1U << 26U)   /*!< GPIO pin mask */
#define BOARD_INITPINS_CAN1_LED_PORT                                       GPIO1   /*!< PORT peripheral base pointer */
#define BOARD_INITPINS_CAN1_LED_PIN                                          26U   /*!< PORT pin number */
#define BOARD_INITPINS_CAN1_LED_PIN_MASK                             (1U << 26U)   /*!< PORT pin mask */

/* GPIO_B0_03 (coord D8), TEENSY_LED */
/* Routed pin properties */
#define BOARD_INITPINS_TEENSY_LED_PERIPHERAL                               GPIO2   /*!< Peripheral name */
#define BOARD_INITPINS_TEENSY_LED_SIGNAL                                 gpio_io   /*!< Signal name */
#define BOARD_INITPINS_TEENSY_LED_CHANNEL                                     3U   /*!< Signal channel */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_TEENSY_LED_GPIO                                     GPIO2   /*!< GPIO peripheral base pointer */
#define BOARD_INITPINS_TEENSY_LED_GPIO_PIN                                    3U   /*!< GPIO pin number */
#define BOARD_INITPINS_TEENSY_LED_GPIO_PIN_MASK                       (1U << 3U)   /*!< GPIO pin mask */
#define BOARD_INITPINS_TEENSY_LED_PORT                                     GPIO2   /*!< PORT peripheral base pointer */
#define BOARD_INITPINS_TEENSY_LED_PIN                                         3U   /*!< PORT pin number */
#define BOARD_INITPINS_TEENSY_LED_PIN_MASK                            (1U << 3U)   /*!< PORT pin mask */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitPins(void);

#if defined(__cplusplus)
}
#endif

/*!
 * @}
 */
#endif /* _PIN_MUX_H_ */

/***********************************************************************************************************************
 * EOF
 **********************************************************************************************************************/
